cases/16_h8_s2/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  www.openfoam.com
    \\  /    A nd           | Version:  v2106
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1e-8;

boundaryField
{
    inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.005;
        value           uniform 1e-8;
    }
    
    outlet
    {
        type            zeroGradient;
    }
    
    wall_bottom
    {
        type            epsilonWallFunction;
        value           uniform 1e-8;
    }
    
    wall_top
    {
        type            epsilonWallFunction;
        value           uniform 1e-8;
    }
    
    fins
    {
        type            epsilonWallFunction;
        value           uniform 1e-8;
    }
    
    front
    {
        type            empty;
    }
    
    back
    {
        type            empty;
    }
}

// ************************************************************************* //
