cases/16_h8_s2/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  www.openfoam.com
    \\  /    A nd           | Version:  v2106
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    
    wall_bottom
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    
    wall_top
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    
    fins
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    
    front
    {
        type            empty;
    }
    
    back
    {
        type            empty;
    }
}

// ************************************************************************* //
